[
    {
        "text": "I'm a software developer with over three years of experience — defined here in the dictionary as:",
        "imageToSearch": ""
    },
    {
        "text": "For about two years, I searched for a job in the field while learning to program in different languages. I typically use TypeScript now, but I started with Java, then moved on to JavaScript and Node.js, and later PHP in college.",
        "imageToSearch": ""
    },
    {
        "text": "I passed all my classes except for Java, as I was working at the time and didn't prepare myself enough for it.",
        "imageToSearch": "waiting"
    },
    {
        "text": "Time passed, and I returned to retake the Java exam, this time fully prepared. I studied on my own instead of attending classes, and when I took the final test, I scored a 10. Now, all I had left was to complete the final project.",
        "imageToSearch": "medal"
    },
    {
        "text": "For this final project, I felt confident after earning my degree without much trouble. I decided to build it using Next.js. I'd only heard about it at the time, but the idea of server-side rendering was really interesting to me. This approach let me handle everything on the front end, so I dove right in.",
        "imageToSearch": "Confusion"
    },
    {
        "text": "I started the project without any knowledge of the damn framework, so it was a real challenge. But day by day, I learned something new. In the end, even though it wasn't the most beautifully designed project — visually or architecturally — it worked just as described in the presentation. It consumed an API from Deezer via RapidAPI, and with my own endpoints, I could create and manage lists, songs, and users.",
        "imageToSearch": ""
    },
    {
        "text": "So, I got my degree and started looking for a job. It was a year of desperation until I finally landed an interview. I went to the first one, and because I usually have autosave enabled on my computer, I was so nervous that I messed up. But I finally got a fucking interview after sending out 2,000 applications. Yes, about two thousand.",
        "imageToSearch": "searching"
    },
    {
        "text": "After that, I had another interview, this time for a JavaScript position. Surprisingly, the test was in PHP — a language I don't particularly enjoy working with — but I did it, and to my surprise, I got the job.",
        "imageToSearch": "php"
    },
    {
        "text": "Unfortunately, even though it was my first position and I worked with some great people, the role was nothing like what I was looking for. It was mostly JavaScript and PHP, which I could handle, but sometimes… WordPress and real-time chat support for users while programming. I hate WordPress. I had a terrible experience with it years ago, and although I found a job that allowed me to distance myself from user support, it ended up mixing programming with constant interruptions, which is not ideal for programming. Sure, it makes it easy to create a page quickly, but that's just not for me. I want to work directly with the code, between the lines. Honestly, I'd rather work as a Linux sysadmin — or even in a kitchen again — than do WordPress development.",
        "imageToSearch": ""
    },
    {
        "text": "So finally, when it was time to renew my contract, I didn't like the offer from the company. I felt like I would be trapped in WordPress forever, and I also disagreed with the company's direction. We couldn't reach an agreement, so after a year of work, I started the job search all over again.",
        "imageToSearch": "break"
    },
    {
        "text": "Nowadays, I continue searching almost every day for a job as a software developer while learning new things. The latest technology I've been diving into is Angular, and I'm still working on mastering it. This page is created with Angular and Tailwind just for fun and practice. I'm also teaching myself English, which is why I write all this text in English. Unfortunately, given the state of the job market, I might have to start working in a bar soon. I don't have high expectations of landing a job right now, but I'm still trying.",
        "imageToSearch": "hard work"
    },
    {
        "text": "So, if you've read through my entire story, thank you! I hope you're looking for a developer — one who, even if not the best, is dedicated and constantly working to improve. Have a nice day!",
        "imageToSearch": "thanks"
    }
]